In [11]:
import sqlite3

conn = sqlite3.connect('main_database2.db')
cur = conn.cursor()

In [12]:
#pupulate UNIVERSITY Table
cur.execute('DROP TABLE IF EXISTS UNIVERSITY;')
cur.execute('''
CREATE TABLE UNIVERSITY(
    UNI_ID VARCHAR2(4) NOT NULL UNIQUE PRIMARY KEY,
    NAME VARCHAR2(60) NOT NULL,
    LOCATION VARCHAR(255) NOT NULL
);
''')
cur.execute(''' INSERT INTO UNIVERSITY(UNI_ID,NAME,LOCATION) VALUES('BUET','Bangladesh University of Engineering and Technology', 'Dhaka-1000');''')
cur.execute(''' INSERT INTO UNIVERSITY(UNI_ID,NAME,LOCATION) VALUES('CUET','Chittagong University of Engineering and Technology', 'Pahartoli, Raozan-4349, Chittagong');''')
cur.execute(''' INSERT INTO UNIVERSITY(UNI_ID,NAME,LOCATION) VALUES('KUET','Khulna University of Engineering and Technology', 'Fulbarigate,Khulna');''')
cur.execute(''' INSERT INTO UNIVERSITY(UNI_ID,NAME,LOCATION) VALUES('RUET','Rajshahi University of Engineering and Technology', 'Kazla, Rajshahi-6204');''')

cur.execute('SELECT * FROM UNIVERSITY;')
for line in cur.fetchall():
    for item in line:
        print(item, end=' \t')
    print('')

BUET 	Bangladesh University of Engineering and Technology 	Dhaka-1000
CUET 	Chittagong University of Engineering and Technology 	Pahartoli, Raozan-4349, Chittagong
KUET 	Khulna University of Engineering and Technology 	Fulbarigate,Khulna
RUET 	Rajshahi University of Engineering and Technology 	Kazla, Rajshahi-6204

In [13]:
cur.execute('DROP TABLE IF EXISTS SUBJECT;')
cur.execute('''
CREATE TABLE SUBJECT(
    SUB_ID VARCHAR2(4) NOT NULL UNIQUE PRIMARY KEY,
    NAME VARCHAR2(60) NOT NULL
);
''')

cur.execute('''INSERT INTO SUBJECT(SUB_ID,NAME) VALUES('ARCH','Architecture');''')
cur.execute('''INSERT INTO SUBJECT(SUB_ID,NAME) VALUES('BECM','Building Engineering and Construction Management');''')
cur.execute('''INSERT INTO SUBJECT(SUB_ID,NAME) VALUES('BME','Biomedical Engineering');''')
cur.execute('''INSERT INTO SUBJECT(SUB_ID,NAME) VALUES('CE','Civil Engineering');''')
cur.execute('''INSERT INTO SUBJECT(SUB_ID,NAME) VALUES('CFPE','Chemical and Food Process Engineering');''')
cur.execute('''INSERT INTO SUBJECT(SUB_ID,NAME) VALUES('CHE','Chemical Engineering');''')
cur.execute('''INSERT INTO SUBJECT(SUB_ID,NAME) VALUES('CSE','Computer Science and Engineering');''')
cur.execute('''INSERT INTO SUBJECT(SUB_ID,NAME) VALUES('ECE','Electrical and Computer Engineering');''')
cur.execute('''INSERT INTO SUBJECT(SUB_ID,NAME) VALUES('EEE','Electrical and Electronics Engineering');''')
cur.execute('''INSERT INTO SUBJECT(SUB_ID,NAME) VALUES('ESE','Energy Science and Engineering');''')
cur.execute('''INSERT INTO SUBJECT(SUB_ID,NAME) VALUES('ETE','Electronics and Telecommunication Engineering');''')
cur.execute('''INSERT INTO SUBJECT(SUB_ID,NAME) VALUES('GCE','Glass and Ceramic Engineering');''')
cur.execute('''INSERT INTO SUBJECT(SUB_ID,NAME) VALUES('IEM','Industrial Engineering and Management');''')
cur.execute('''INSERT INTO SUBJECT(SUB_ID,NAME) VALUES('IPE','Industrial and Production Engineering');''')
cur.execute('''INSERT INTO SUBJECT(SUB_ID,NAME) VALUES('LE','Lather Engineering');''')
cur.execute('''INSERT INTO SUBJECT(SUB_ID,NAME) VALUES('MSE','Material Science and Engineering');''')
cur.execute('''INSERT INTO SUBJECT(SUB_ID,NAME) VALUES('ME','Mechanical Engineering');''')
cur.execute('''INSERT INTO SUBJECT(SUB_ID,NAME) VALUES('MIE','Mechatronics and Industrial Engineering');''')
cur.execute('''INSERT INTO SUBJECT(SUB_ID,NAME) VALUES('MTE','Mechatronics Engineering');''')
cur.execute('''INSERT INTO SUBJECT(SUB_ID,NAME) VALUES('TE','Textile Engineering');''')
cur.execute('''INSERT INTO SUBJECT(SUB_ID,NAME) VALUES('PME','Petrolium and Mining Engineering');''')
cur.execute('''INSERT INTO SUBJECT(SUB_ID,NAME) VALUES('URP','Urbal and Regional Planning');''')
cur.execute('''INSERT INTO SUBJECT(SUB_ID,NAME) VALUES('WRE','Water Resources Engineering');''')

cur.execute('SELECT * FROM SUBJECT;')
for line in cur.fetchall():
    for item in line:
        print(item, end=' \t')
    print('')

ARCH 	Architecture
BECM 	Building Engineering and Construction Management
BME 	Biomedical Engineering
CE 	Civil Engineering
CFPE 	Chemical and Food Process Engineering
CHE 	Chemical Engineering
CSE 	Computer Science and Engineering
ECE 	Electrical and Computer Engineering
EEE 	Electrical and Electronics Engineering
ESE 	Energy Science and Engineering
ETE 	Electronics and Telecommunication Engineering
GCE 	Glass and Ceramic Engineering
IEM 	Industrial Engineering and Management
IPE 	Industrial and Production Engineering
LE 	Lather Engineering
MSE 	Material Science and Engineering
ME 	Mechanical Engineering
MIE 	Mechatronics and Industrial Engineering
MTE 	Mechatronics Engineering
TE 	Textile Engineering
PME 	Petrolium and Mining Engineering
URP 	Urbal and Regional Planning
WRE 	Water Resources Engineering

In [14]:
cur.execute('DROP TABLE IF EXISTS UNI_SUB;')
cur.execute('''
CREATE TABLE UNI_SUB(
    UNI_ID VARCHAR2(4) REFERENCES UNIVERSITY(UNI_ID),
    SUB_ID VARCHAR2(4) REFERENCES SUBJECT(SUB_ID),
    CAPASITY INT NOT NULL,
    QUOTA_CAPASITY INT NOT NULL,
    FILLED INT DEFAULT 0,
    QUOTA_FILLED DEFAULT 0
);
''')

cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('BUET','ARCH','55','1');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('BUET','BME','30','0');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('BUET','CE','195','1');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('BUET','CHE','60','1');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('BUET','CSE','120','1');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('BUET','EEE','195','0');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('BUET','IPE','30','0');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('BUET','NAME','55','0');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('BUET','ME','180','1');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('BUET','MME','50','0');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('BUET','URP','30','1');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('BUET','WRE','30','0');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('CUET','ARCH','30','1');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('CUET','BME','30','0');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('CUET','CE','130','1');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('CUET','CSE','130','1');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('CUET','EEE','180','1');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('CUET','ETE','60','0');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('CUET','MSE','30','1');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('CUET','ME','180','1');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('CUET','MIE','30','0');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('CUET','PME','30','0');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('CUET','WRP','30','0');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('CUET','WRE','30','0');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('KUET','ARCH','40','1');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('KUET','BECM','60','1');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('KUET','BME','30','0');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('KUET','CHE','30','0');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('KUET','CE','120','1');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('KUET','CSE','120','1');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('KUET','EEE','120','1');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('KUET','ECE','60','0');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('KUET','ESE','30','1');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('KUET','IEM','60','0');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('KUET','LE','60','0');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('KUET','MSE','60','0');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('KUET','ME','120','1');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('KUET','MTE','30','0');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('KUET','TE','60','0');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('KUET','URP','60','1');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('RUET','ARCH','30','1');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('RUET','BECM','30','0');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('RUET','CFPE','30','0');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('RUET','CE','180','1');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('RUET','CSE','180','0');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('RUET','EEE','180','1');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('RUET','ECE','60','0');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('RUET','ETE','60','0');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('RUET','GCE','60','0');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('RUET','IPE','60','1');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('RUET','ME','180','1');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('RUET','MSE','60','0');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('RUET','MTE','60','1');''')
cur.execute('''INSERT INTO UNI_SUB(UNI_ID,SUB_ID,CAPASITY,QUOTA_CAPASITY) VALUES('RUET','URP','60','1');''')

cur.execute('SELECT * FROM UNI_SUB;')
for line in cur.fetchall():
    for item in line:
        print(item, end=' \t')
    print('')

BUET 	ARCH 	55 	1 	0 	0
BUET 	BME 	30 	0 	0 	0
BUET 	CE 	195 	1 	0 	0
BUET 	CHE 	60 	1 	0 	0
BUET 	CSE 	120 	1 	0 	0
BUET 	EEE 	195 	0 	0 	0
BUET 	IPE 	30 	0 	0 	0
BUET 	NAME 	55 	0 	0 	0
BUET 	ME 	180 	1 	0 	0
BUET 	MME 	50 	0 	0 	0
BUET 	URP 	30 	1 	0 	0
BUET 	WRE 	30 	0 	0 	0
CUET 	ARCH 	30 	1 	0 	0
CUET 	BME 	30 	0 	0 	0
CUET 	CE 	130 	1 	0 	0
CUET 	CSE 	130 	1 	0 	0
CUET 	EEE 	180 	1 	0 	0
CUET 	ETE 	60 	0 	0 	0
CUET 	MSE 	30 	1 	0 	0
CUET 	ME 	180 	1 	0 	0
CUET 	MIE 	30 	0 	0 	0
CUET 	PME 	30 	0 	0 	0
CUET 	WRP 	30 	0 	0 	0
CUET 	WRE 	30 	0 	0 	0
KUET 	ARCH 	40 	1 	0 	0
KUET 	BECM 	60 	1 	0 	0
KUET 	BME 	30 	0 	0 	0
KUET 	CHE 	30 	0 	0 	0
KUET 	CE 	120 	1 	0 	0
KUET 	CSE 	120 	1 	0 	0
KUET 	EEE 	120 	1 	0 	0
KUET 	ECE 	60 	0 	0 	0
KUET 	ESE 	30 	1 	0 	0
KUET 	IEM 	60 	0 	0 	0
KUET 	LE 	60 	0 	0 	0
KUET 	MSE 	60 	0 	0 	0
KUET 	ME 	120 	1 	0 	0
KUET 	MTE 	30 	0 	0 	0
KUET 	TE 	60 	0 	0 	0
KUET 	URP 	60 	1 	0 	0
RUET 	ARCH 	30 	1 	0 	0
RUET 	BECM 	30 	0 	0 	0
RUET 	CFPE 	30 	0 	0 	0
RUET 	CE 	180 	1 	0 	0
RUET 	CSE 	180 	0 	0 	0
RUET 	EEE 	180 	1 	0 	0
RUET 	ECE 	60 	0 	0 	0
RUET 	ETE 	60 	0 	0 	0
RUET 	GCE 	60 	0 	0 	0
RUET 	IPE 	60 	1 	0 	0
RUET 	ME 	180 	1 	0 	0
RUET 	MSE 	60 	0 	0 	0
RUET 	MTE 	60 	1 	0 	0
RUET 	URP 	60 	1 	0 	0

In [15]:
# Subject lists and seats in BUET
cur.execute('''
SELECT S.NAME, US.CAPASITY, US.QUOTA_CAPASITY
FROM UNI_SUB US JOIN SUBJECT S ON US.SUB_ID = S.SUB_ID 
WHERE US.UNI_ID = 'BUET';
''')
for line in cur.fetchall():
    for item in line:
        print(item, end=' \t')
    print('')

Architecture 	55 	1
Biomedical Engineering 	30 	0
Civil Engineering 	195 	1
Chemical Engineering 	60 	1
Computer Science and Engineering 	120 	1
Electrical and Electronics Engineering 	195 	0
Industrial and Production Engineering 	30 	0
Mechanical Engineering 	180 	1
Urbal and Regional Planning 	30 	1
Water Resources Engineering 	30 	0

In [16]:
cur.execute(''' DROP TABLE IF EXISTS EXAM_CENTER; ''')
cur.execute('''
CREATE TABLE EXAM_CENTER(
    CENTER_ID VARCHAR2(4) NOT NULL PRIMARY KEY,
    NAME VARCHAR2(60) NOT NULL,
    LOCATION VARCHAR2(255) NOT NULL,
    CAPASITY INT NOT NULL,
    FILLED INT DEFAULT 0
);
''')

cur.execute(''' INSERT INTO EXAM_CENTER(CENTER_ID,NAME,LOCATION,CAPASITY) VALUES('BUET','Bangladesh University of Engineering and Technology', 'Dhaka-1000',8000);''')
cur.execute(''' INSERT INTO EXAM_CENTER(CENTER_ID,NAME,LOCATION,CAPASITY) VALUES('CUET','Chittagong University of Engineering and Technology', 'Pahartoli, Raozan-4349, Chittagong',7000);''')
cur.execute(''' INSERT INTO EXAM_CENTER(CENTER_ID,NAME,LOCATION,CAPASITY) VALUES('KUET','Khulna University of Engineering and Technology', 'Fulbarigate,Khulna',7000);''')
cur.execute(''' INSERT INTO EXAM_CENTER(CENTER_ID,NAME,LOCATION,CAPASITY) VALUES('RUET','Rajshahi University of Engineering and Technology', 'Kazla, Rajshahi-6204',7000);''')
cur.execute(''' INSERT INTO EXAM_CENTER(CENTER_ID,NAME,LOCATION,CAPASITY) VALUES('SUST','Sylhet University of Science and Technology', 'University Ave, Sylhet 3114',7000);''')

cur.execute('''SELECT * FROM EXAM_CENTER''')
for line in cur.fetchall():
    for item in line:
        print(item, end=' \t')
    print('')

BUET 	Bangladesh University of Engineering and Technology 	Dhaka-1000 	8000 	0
CUET 	Chittagong University of Engineering and Technology 	Pahartoli, Raozan-4349, Chittagong 	7000 	0
KUET 	Khulna University of Engineering and Technology 	Fulbarigate,Khulna 	7000 	0
RUET 	Rajshahi University of Engineering and Technology 	Kazla, Rajshahi-6204 	7000 	0
SUST 	Sylhet University of Science and Technology 	University Ave, Sylhet 3114 	7000 	0

In [17]:
# cur.execute('''
# CREATE SEQUENCE new_sequence
# MINVALUE 100000
# START WITH 111111
# INCREMENT BY 1
# CACHE 10; 
# ''')

In [18]:
cur.execute('''DROP TABLE IF EXISTS STUDENT;''')
cur.execute('''
CREATE TABLE STUDENT(
    STUDENT_ID INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT,
    HSC_ROLL INTEGER NOT NULL,
    HSC_REG INTEGER NOT NULL,
    NAME VARCHAR2(100) NOT NULL,
    BIRTHDATE DATE NOT NULL,
    QUOTA_STATUS VARCHAR(1) DEFAULT 'N',
    CENTER_ID VARCHAR2(4) NOT NULL REFERENCES EXAM_CENTER(CENTER_ID),
    PHY_MARK INTEGER DEFAULT 0,
    CHM_MARK INTEGER DEFAULT 0,
    MATH_MARK INTEGER DEFAULT 0,
    MERIT_POS INTEGER DEFAULT NULL,
    QUOTA_POS INTEGER DEFAULT NULL 
);
''')

fhand = open('StudentQueries.sql')
for line in fhand.readlines():
    line = line.strip()
    cur.execute(line)


cur.execute('''SELECT * FROM STUDENT LIMIT 5''')
for line in cur.fetchall():
    for item in line:
        print(item, end=' \t')
    print('')

1 	9961474 	191365123 	Garth Mollah 	3/5/2001 	N 	KUET 	0 	0 	0 	None 	None
2 	7208965 	189267972 	Jerimy Sikder 	1/5/2000 	N 	KUET 	0 	0 	0 	None 	None
3 	4587551 	147718159 	Mickey Rahim 	28/1/2001 	N 	KUET 	0 	0 	0 	None 	None
4 	5373983 	357302290 	Primus Sagar 	26/4/2001 	N 	KUET 	0 	0 	0 	None 	None
5 	4063265 	375521302 	Aditya Rasel 	8/8/2001 	N 	KUET 	0 	0 	0 	None 	None

In [19]:
# Watching the change in exam_center
cur.execute('''
SELECT CENTER_ID,FILLED FROM EXAM_CENTER;
''')
for line in cur.fetchall():
    for item in line:
        print(item, end=' \t')
    print('')

BUET 	6184
CUET 	6283
KUET 	7000
RUET 	6208
SUST 	6301

In [26]:
# filling mark for students
import random 
mark_range = range(40,300)
primary_keys = list()

cur.execute('''SELECT STUDENT_ID FROM STUDENT''')
for line in cur.fetchall():
    line = line[0]
    primary_keys.append(line)


for i in range(len(primary_keys)):
    querystr = 'UPDATE STUDENT SET PHY_MARK='+str(random.choice(mark_range))+',MATH_MARK='+str(random.choice(mark_range))+',CHM_MARK='+str(random.choice(mark_range))+' WHERE STUDENT_ID='+str(primary_keys[i])+';'
    cur.execute(querystr)

In [34]:

cur.execute('''SELECT 
RANK() OVER( ORDER BY MATH_MARK+PHY_MARK+CHM_MARK DESC, MATH_MARK DESC, PHY_MARK DESC, CHM_MARK DESC, BIRTHDATE DESC, NAME ASC ) table_rank,
STUDENT_ID,NAME,MATH_MARK+PHY_MARK+CHM_MARK as "Total marks",MATH_MARK,PHY_MARK,CHM_MARK 
FROM STUDENT LIMIT 50''')
for line in cur.fetchall():
    print(line)
    cur.execute('UPDATE STUDENT SET MERIT_POS='+str(line[0])+'WHERE STUDENT_ID='+str(line[1])+';'
    ''')

(1, 21484, 'Shantell Kamal', 888, 297, 294, 297)
(2, 28898, 'Zana Das', 888, 291, 299, 298)
(3, 14840, 'Alvaro Pramanik', 881, 285, 299, 297)
(4, 10357, 'Raphael Datta', 880, 299, 294, 287)
(5, 23882, 'Josie Dey', 875, 282, 299, 294)
(6, 30411, 'Philomena Mukta', 874, 297, 292, 285)
(7, 28181, 'Kaci Karmakar', 874, 295, 298, 281)
(8, 29333, 'Karren Afroz', 873, 297, 282, 294)
(9, 24546, 'Yasmine Gomes', 869, 299, 279, 291)
(10, 31573, 'Lelia Alam', 869, 291, 292, 286)
(11, 11073, 'Attilio Huda', 869, 286, 289, 294)
(12, 23433, 'Levina Kamrunnahar', 868, 291, 299, 278)
(13, 19035, 'Collin Amin', 868, 280, 297, 291)
(14, 19318, 'Isadore Jamil', 868, 273, 297, 298)
(15, 1584, 'Ell Basar', 866, 274, 297, 295)
(16, 10238, 'Danny Shihab', 864, 296, 299, 269)
(17, 7997, 'Paxton Masum', 860, 297, 264, 299)
(18, 9234, 'Yahir Kibria', 860, 286, 294, 280)
(19, 11508, 'Robley Sikder', 860, 286, 276, 298)
(20, 22677, 'Patrice Nahar', 859, 297, 279, 283)
(21, 2056, 'Brycen Talukdar', 859, 287, 281, 291)
(22, 10050, 'Boss Dhar', 858, 295, 278, 285)
(23, 13573, 'Cason Debnath', 856, 276, 281, 299)
(24, 4414, 'Caroline Fahad', 856, 271, 289, 296)
(25, 11286, 'Travis Rabbi', 855, 280, 289, 286)
(26, 17056, 'Chase Chakma', 855, 271, 293, 291)
(27, 25379, 'Suzanna Lima', 854, 296, 283, 275)
(28, 1815, 'Kasen Salam', 854, 292, 269, 293)
(29, 1955, 'Rosco Khalil', 853, 293, 276, 284)
(30, 16050, 'Jade Halim', 852, 277, 293, 282)
(31, 12002, 'Vincenzo Hakim', 851, 298, 254, 299)
(32, 26311, 'Cori Taslima', 851, 283, 284, 284)
(33, 18128, 'Lowell Hasan', 851, 277, 295, 279)
(34, 31643, 'Khadijah Siddique', 849, 286, 276, 287)
(35, 1055, 'Ocie Sohel', 849, 285, 293, 271)
(36, 200, 'Lovie Ahmmed', 848, 279, 297, 272)
(37, 24637, 'Penelope Karim', 848, 279, 274, 295)
(38, 9925, 'Joey Arif', 848, 270, 287, 291)
(39, 10427, 'Tracey Rabbi', 845, 281, 295, 269)
(40, 2385, 'Zack Pramanik', 845, 273, 280, 292)
(41, 19607, 'Olive Alamin', 845, 270, 284, 291)
(42, 6090, 'Esley Ibrahim', 845, 263, 298, 284)
(43, 12738, 'Ovid Mazumder', 844, 294, 265, 285)
(44, 26463, 'Shonda Gomes', 844, 282, 292, 270)
(45, 12593, 'Tracy Bari', 843, 296, 272, 275)
(46, 22484, 'Vena Lima', 843, 291, 279, 273)
(47, 19701, 'Greene Hossain', 843, 287, 288, 268)
(48, 23993, 'Tia Ahmed', 843, 282, 281, 280)
(49, 8575, 'Frances Howlader', 843, 279, 276, 288)
(50, 16292, 'Sigurd Faruk', 843, 274, 290, 279)

In [10]:
conn.close()